diplom-src/src/Documents/ВКМ_ВыплатаЗарплаты/ВКМ_ВыплатаЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ВыплатаЗарплаты</name>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <tabularSections>
    <name>Выплаты</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Специалисты</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

diplom-src/src/AccumulationRegisters/ВКМ_ВзаиморасчетыССотрудниками/ВКМ_ВзаиморасчетыССотрудниками.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ВКМ_ВзаиморасчетыССотрудниками</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_Специалисты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

diplom-src/src/Documents/ВКМ_ВыплатаЗарплаты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
	Для Каждого Строка Из Выплаты Цикл
		ВзаиморасчетыПоСотруднику = РегистрыНакопления.ВКМ_ВзаиморасчетыССотрудниками.ВзаиморасчетыПоСотруднику(Строка.Сотрудник);
		Если ВзаиморасчетыПоСотруднику <= 0 Тогда
			Текст = СтрШаблон("У сотрудника %1 недостаточно начислений для выплаты зарплаты", Строка.Сотрудник);
			ОбщегоНазначения.СообщитьПользователю(Текст);
			Отказ = Истина;
			Возврат;
		Иначе
			Если ВзаиморасчетыПоСотруднику < Строка.Сумма Тогда
				Строка.Сумма = ВзаиморасчетыПоСотруднику;
				Текст = СтрШаблон("У сотрудника %1 заменена суммы выплаты в соответствии с начислениями", Строка.Сотрудник);
				ОбщегоНазначения.СообщитьПользователю(Текст);
			КонецЕсли;
		КонецЕсли;
		
		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Сотрудник = Строка.Сотрудник;
		Движение.Сумма = Строка.Сумма;
		Движение.Регистратор = Ссылка;
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
